//
//  SubgroupsCatalog.swift
//  college-ios-app
//
//  Created by pc on 21.09.2025.
//

import Foundation

struct SubgroupsCatalog {
    static let allSubgroups: [String] = [
        // Вся группа
        "*",
        
        // Английский 1 курс
        "A0.11", "A0.12", "A1.11", "A1.12",
        "A2.11", "A2.12", "B1.11", "B1.12",
        
        // Английский 2 курс
        "A0.21", "A1.21", "A1.22", "A1.23",
        "A2.21", "A2.22", "B1.21", "B1.22",
        
        // Английский 3 курс
        "A1.31", "A2.31", "B1.31",
        
        // Английский 4 курс
        "A1.41", "A2.41", "B1.41",
        
        // Подгруппы
        "Подгр1", "Подгр2", "Подгр3", "Подгр4",
        
        // Профили
        "BE", "FE", "GD", "PM", "SA", "CD"
    ]
}
